// =============================================================================
// 2. 读取模块 (read_ctrl) - 负责发起读请求
// =============================================================================
module read_ctrl (
    input               clk,        // 系统工作时钟
    input               rst_n,      // 系统异步复位，低电平有效

    // 外部触发源（若为纯自动轮询自测可悬空内部自增）
    input               rd_trig,    // 单次读取触发指示（可选）
    input       [6:0]   din_addr,   // 待读取外部目标地址（可选）

    // 与命令模块交互接口 (有缓存 rdy 模式)
    input               rd_rdy,     // 读就绪信号（来自命令模块，FIFO2未满）
    output reg          rd_en,      // 读使能脉冲
    output reg  [6:0]   raddr_i     // 读取目标地址
);

endmodule
