// =============================================================================
// 1. 存储模块 (store_ctrl) - 负责发起写请求
// =============================================================================
module store_ctrl (
    input               clk,        // 系统工作时钟 50MHz/100MHz
    input               rst_n,      // 系统异步复位，低电平有效

    // 外部触发/业务源（若为纯自动轮询自测可悬空内部自增）
    input               wr_trig,    // 单次写入触发指示（可选）
    input       [6:0]   din_addr,   // 待写入外部地址（可选）
    input       [7:0]   din_data,   // 待写入外部数据（可选）

    // 与命令模块交互接口 (有缓存 rdy 模式)
    input               wr_rdy,     // 写就绪信号（来自命令模块，FIFO1未满）
    output reg          wr_en,      // 写使能脉冲
    output reg  [6:0]   waddr_i,    // 写入目标地址
    output reg  [7:0]   wdata_i     // 写入数据
);

endmodule
